Tekla.Structures.Drawing.HatchAttributes
The HatchAttributes base class, inherited by ModelObjectHatchAttributes
and GraphicObjectHatchAttributes, contains hatch attributes.

Tekla.Structures.Drawing.HatchAttributes.Name
The name of the hatch.
If an empty string is given as hatch name it will become "None".

Tekla.Structures.Drawing.HatchAttributes.Color
The color of the hatch.

Tekla.Structures.Drawing.HatchAttributes.TrueColor
The true color (RGB enabled) of the hatch.
Throws System.ArgumentOutOfRangeException: The get method will
throw if the inputColor is not supported (0-7, 120 for example).
You should use this function in a try-catch statement, since
non-supported colors are used in TeklaStructures, especially in
older models. Define your own catch logic (default color, error
message, etc) based on your use case.

Tekla.Structures.Drawing.HatchAttributes.BackgroundColor
The background color of the hatch.

Tekla.Structures.Drawing.HatchAttributes.TrueBackgroundColor
The true color (rgb enabled) of the hatch background.
Throws System.ArgumentOutOfRangeException: The get method will
throw if the inputColor is not supported (0-7, 120 for example).
You should use this function in a try-catch statement, since
non-supported colors are used in TeklaStructures, especially in
older models. Define your own catch logic (default color, error
message, etc) based on your use case.

Tekla.Structures.Drawing.HatchAttributes.DrawBackgroundColor
Sets whether the background color will be enabled or disabled for the hatch.
See also: Tekla.Structures.Drawing.HatchAttributes.BackgroundColor.

Tekla.Structures.Drawing.HatchAttributes.Angle
The angle in which to draw the hatch.

Tekla.Structures.Drawing.HatchAttributes.FactorType
The type of the hatch factor.

Tekla.Structures.Drawing.HatchAttributes.ScaleX
The scale value of the hatch in the X-direction.

Tekla.Structures.Drawing.HatchAttributes.ScaleY
The scale value of the hatch in the Y-direction.